# GetTaperedComponent

## Description
Gets the tapered component of the object.

```pascal
FUNCTION GetTaperedComponent(object : HANDLE): INTEGER;
```

```python
def vs.GetTaperedComponent(object):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a slab, Slab Style, or the Slab Preferences.|

## See Also
VS Functions:
SetTaperedComponent

## Version
Availability: from Vectorworks 2017

## Category
* Objects - Architectural